#### Terraform Plan ('src/domains/cgn/prod') 📖
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.bonus_owner_cgn will be created
  + resource "azurerm_role_assignment" "bonus_owner_cgn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "831e5214-2f68-4a13-b25f-7bec962c7e1b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.azurerm_private_endpoint.private_endpoint_storage_account_legal_backup will be updated in-place
  ~ resource "azurerm_private_endpoint" "private_endpoint_storage_account_legal_backup" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cgn-legalbackup-storage"
        name                          = "io-p-cgn-legalbackup-storage"
      ~ tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  - resource_group_cgn_be        = {
      - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg"
      - name = "io-p-cgn-be-rg"
    } -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
